//외형 이름
const wp_label_appear = [
  '역병 ',
  '괴수의 ',
  '용암석 ',
  '감시자의 ',
  '용의 ',
  '독사의 ',
  '세계수 ',
  '파수꾼의 ',
  '기계 갑주 ',
  '하늘 바람 ',
  '강철 발톱 ',
  '금은보화 ',
];
//이펙트
const wp_label_effect = [
  '혼돈의 ',
  '타오르는 ',
  '푸른 폭풍의 ',
  '연소하는 ',
  '연쇄 폭발의 ',
  '섬광의 ',
  '오로라의 ',
  '가시덤불의 ',
  '화살비의 ',
  '천둥번개의 ',
  '거센 파도의 ',
  '눈폭풍의 ',
];

//무기 이름
const wp_label_name = [
  '단검',
  '지팡이',
  '장궁',
  '마법 오브',
  '도끼',
  '해머',
  '총',
  '메이스',
  '쌍절곤',
  '랜스',
  '쌍검',
  '레이피어',
  '하프',
  '대검',
  '건틀릿',
  '채찍',
];

//무기 주 설명란
const wp_main_txt_list = [
  '망령을 몰고 오는 자여, 그 죽음을 집어 삼켜라.',
  '굳세고 단련된 자여, 그 분노를 이겨내라.',
  '증오로 끓어오르는 자여, 수만 번 자신을 망치질하라.',
  '침착하고 신중한 자여, 거짓된 세상을 통찰하라.',
  '천상에 도전하는 자여, 올곧은 마음으로 자신을 시험하라.',
  '예리하고 날카로운 자여, 얽매임 없이 모두 꿰뚫어라.',
  '세계수의 뿌리를 쥔 자여, 그 힘을 다스려 손에 얻어라',
  '양떼를 모는 자여, 거짓 없는 지혜를 세상에 펼쳐라.',
  '견고한 갑주와 같은 자여, 수없이 고뇌하고 인내하라.',
  '드높은 하늘로 향하는 자여, 그 끝을 향해 솟구쳐라.',
  '강철의 발톱을 두른 자여, 용맹하게 포효하라.',
  '화려하게 뽐내는 자여, 진실된 자신의 값어치를 증명하라.',
];

//색상 이름: white, black, blue, red, yellow
const wp_label_color = ['은회색 ', '암흑 ', '푸른색 ', '진홍색 ', '황색 '];

//서브 텍스트 1
const wp_sub_txt_list_a = [
  '생명을 앗아가는 어둠의 기운이 깃들어있습니다.',
  '뜨겁고 맹렬한 붉은 화염의 열기가 무기의 중심부에서 느껴집니다.',
  '예리하고 날카로운 칼바람이 무기를 휘감습니다.',
  '신비한 미지의 기운을 내뿜으며 푸른 화염이 타오릅니다.',
  '매캐하고 텁텁한 화약 냄새와 열기가 요동치고 있습니다.',
  '신성한 섬광의 힘이 뿜어져 나옵니다 .',
  '몽환적이고 이질적인 우주의 기운이 느껴집니다.',
  '아름답고 매혹적이면서도, 그 양면에는 차가운 칼날이 깃들어 있습니다.',
  '창공을 가르는 세찬 화살비가 무기 곁을 멤돕니다.',
  '신의 분노를 연상시키는 듯 거대한 번개가 내리칩니다.',
  '거센 파도가 몰아치고 있는 바다의 소리가 메아리칩니다.',
  '온 세상을 얼어붙게 만들 듯한 만년빙의 기운이 담겨 있습니다.',
];
//서브 텍스트 2
const wp_sub_txt_list_b = [
  '저주받은 영혼들이 몸서리치고, 기이한 환청이 들려오는 ',
  '거대한 뿔의 자태가 두더러지며 그 존재감이 과시되는',
  '뜨거운 용암이 무한히 흘러나오며 끝없이 달궈지고 있는',
  '신비한 마력에 휩싸이며, 영혼이 그 중심부로 이끌리는 듯한',
  '고대 용의 기운이 느껴지며, 대지와 하늘의 힘이 모여있는',
  '호시탐탐 착용자의 목덜미를 노릴 기회를 엿보는듯한 착각이 드는',
  '영겁의 세월을 감내해 온 장엄한 세계수의 가지로 만들어진',
  '뼛속까지 시릴 정도로 냉혹한 산맥의 추위를 버텨내는 산양의 털로 장식된 ',
  '천상의 신들이 사용하는 장비가 탄생한 고대 대장간에서 만들어진',
  '성스러운 날개의 끝자락을 타고 미지의 마력이 흘러내리고 있는',
  '날카로운 톱니가 빛나고, 무기에 깃든 괴수의 포효가 들려오는',
  '값비싼 보석들이 영롱하게 빛나며 모두의 이목을 집중시키는',
];

//서브 텍스트 3
const wp_sub_txt_list_c = [
  ' 단검입니다.',
  ' 지팡이입니다.',
  ' 장궁입니다.',
  ' 오브입니다.',
  ' 도끼입니다.',
  ' 해머입니다.',
  ' 총입니다.',
  ' 철퇴입니다.',

  ' 쌍절곤입니다.',
  ' 랜스입니다.',
  ' 쌍검입니다.',
  ' 레이피어입니다.',
  ' 하프입니다.',
  ' 대검입니다.',
  ' 건틀릿입니다.',
  ' 채찍입니다.',
];

//MBTI 관련 성향 1
const wp_spec_1_title = [
  '따끈한 마음',
  '줏대로 판단',
  '나는 매우 귀찮은 상태',
  '플랜 맨',
  '침대 탈출 실패',
  '사장님 나이스 샷',
  '마이스터',
  '정리정돈왕',

  '긍정왕',
  '조별과제 조장',
  '규칙은 깨라고 있는 거야',
  '외강내강',
  '누가 나를 심판하는가',
  '유사 프리스트',
  '무승부로 하지 않을래',
  '현실주의적',
];
const wp_spec_1_desc = [
  '상대가 누구던 친절하고 따뜻한 태도로 맞이합니다. 남을 위해 먼저 배려를 실천할 확률이 증가합니다.',
  '자신만의 기준이 확고하고, 맞지 않는 사람을 잘 가려냅니다. 자기 중심적이기도 하지만 남을 꿰뚫어보는 통찰력이 뛰어납니다.',
  '만사가 귀찮습니다. 남의 일에 별로 신경쓰지 않으려 합니다.',
  '뭐든지 아주 철저하게 계획합니다. 전략을 세우는 능력이 상승하며 이를 기반으로 설계를 실행합니다.',
  '침대 위를 벗어나기란 참 어렵습니다. 침대 탈출 확률이 감소합니다.',
  '공동체가 조화롭게 유지되도록 노력합니다. 헌신적인 조력가로 활동합니다.',
  '손기술이 뛰어난 경우가 많으며, 자기 관심 분야에는 깊게 파고드는 모습을 보입니다.',
  '자기 주변을 늘 정돈하고 질서정연하게 유지하려하는 모습을 보입니다.',

  '활발하고 밝은 모습으로 하루를 시작합니다. 낙관적이고 긍정적인 에너지를 뿜어냅니다.',
  '남들을 이끄는 능력이 탁월합니다. 여러 공동체에서 리더를 도맡을 때가 많습니다.',
  '규칙에 얽매이는 것을 싫어합니다. 개방적이고 자유로운 삶을 원합니다.',
  '외면도 내면도 모두 단단합니다. 이성적이고 두터운 멘탈의 소유자입니다.',
  '자기 페이스에 맞추어 자유롭게 행동하며, 계획적인 것보단 즉흥적인 행동을 더 좋아합니다.',
  '다른 사람들에게 친화적이며, 나눔과 배려를 늘 실천하려 합니다.',
  '내기를 무척이나 좋아하는 자유분방한 성격의 소유자입니다.',
  '현실의 벽에 일찌감치 부딪혀 봤습니다. 상식적, 논리적이며 냉정하기까지 합니다.',
];

//MBTI 관련 성향 2
const wp_spec_2_title = [
  '망상병자',
  '완벽주의',
  '출처를 갖고 오라고',
  '신중한 결정',
  '일은 미루고 보자',
  '겸손은 나의 미덕',
  '극 T',
  '더 타임 키퍼',

  '자유로운 영혼',
  '더불어 사는 삶',
  '독설가',
  '답답해서 내가 뛴다',
  '도파민 메이커',
  '남다른 눈치',
  '좋은 거래입니다',
  '성실근면한 삶',
];
const wp_spec_2_desc = [
  '상상력이 매우 풍부하며, 시도때도 없이 공상에 빠지기도 합니다. 마음만 먹는다면 언제든지 꿈의 세계를 펼칠 수 있습니다.',
  '무엇이든지 완벽하게 해내려고 하는 경향이 있습니다. 사소한 일에도 크게 신경을 쓰며, 이따금씩 강박적이기도 합니다.',
  '사실과 논리에 집착하는 면이 있습니다. 항상 객관적인 근거를 찾아내어 진실여부를 확인하려고 합니다.',
  '결정해야 하는 순간이 온다면 누구보다도 심오하고 신중해집니다. 이럴 때에는 시간을 갖고 여유롭게 기다려야합니다.',
  '현재 바쁜 일이 있을 지라도 미루는 경우가 자주 있습니다. 그래도 일은 확실히 처리합니다.',
  '대체로 겸손한 태도를 보이며 자만하지 않습니다. 때에 따라 자신을 잘 드러내지 않기도 합니다.',
  'T중의 T로, 행동을 하며 감정적인 면모를 배제하는 경우를 자주 볼 수 있습니다. 보이는 것보다 훨씬 이성적입니다.',
  '시간 약속이 있다면 칼같이 지킵니다. 지키지 않는다면 베일 수도 있습니다.',

  '그 무엇도 자신을 묶어둘 것이 없습니다. 이것저것 접해보기도 하고, 다양한 사람을 만나며 여러 경험을 쌓기도 합니다.',
  '다른 사람들과 잘 어울리며, 공동체가 원만하게 유지되도록 노력합니다.',
  '직실적으로 말을 하는 경우가 많고, 때로는 이것이 상대의 마음을 파고드는 비수가 되기도 합니다.',
  '먼저 나서서 문제를 주도적으로 해결하려 합니다. 행동과 실천이 앞서며 이를 바탕으로 다른 이들을 이끕니다.',
  '지루한 순간은 도저히 참을 수 없습니다. 남들을 위해 재미를 만들어내기도, 찾아내기도 합니다.',
  '다른 사람들을 위한 행동을 자주 하는 만큼 눈치를 보는 능력도 대단히 높습니다.',
  '사업가로서 탁월한 능력을 선보이는 경우가 많습니다. 좋은 거래를 위해서라면 모험을 위한 발걸음을 멈추지 않습니다.',
  '규칙과 질서에 익숙하기에 대체로 현실적이고 근면한 생활을 이어가고 있습니다.',
];

//MBTI 관련 특성
const wp_spec_3_title = [
  '숨겨진 칼날',
  '머글의 지팡이',
  '아직 한 발 남았다',
  '기를 모아야 합니다',
  '17대 1의 전설',
  '함마 갖고 와라',
  '내 총 끝은 빛나고',
  '예로부터 이게 약이었다',

  '은둔(안함)고수',
  '랜스가 불타고 있어',
  '의견...갈랐다고...',
  '난 물러서지 않아',
  '무대를 뒤집어 놓으셨다',
  '그것은 검이라기엔 너무 컸다',
  '내 알 바 아니야',
  '똑바로 서라, 팀원',
];
const wp_spec_3_desc = [
  '겉은 친절하고 착해보일지는 몰라도, 그 속에는 아주 예리한 칼날을 품고 있습니다.',
  '다른 사람을 통찰하고 내면을 꿰뚫어보는 능력이 출중하기에, 숨겨져 있던 잠재력을 곧잘 끌어낼 수 있습니다.',
  '귀찮음과는 정반대로, 때때로 주어진 정보를 시간을 들이며 신중하게 분석하기도 합니다. 화살 한 발을 쏘듯이.',
  '신중하고 탐색적인 성격으로 많은 것들을 탐구하고 흡수합니다. 지식의 보고와도 같습니다.',
  '걱정 많고 게을러보여도, 닥쳐온 상황 따위 가볍게 해치울 수 있는 거대한 투력을 담고 있습니다.',
  '사람들 간의 관계를 유지하며 그 사이에서 우직한 존재감을 보여줍니다.',
  '세심하고 분석적인 성격을 기반으로, 예사롭지 않은 한 발을 준비합니다.',
  '자기만의 질서를 굳건히 지키는 타입입니다. 눈에 거슬리게 행동한다거나, 이를 어긴다면 매몰차게 당할 수도 있습니다.',

  '자신이 추구하는 삶의 방향을 위해 성실히 달려나가는, 내면이 강한 자입니다.',
  '뜨겁게 솟아오르는 열정을 불태워 여정을 이끄는 길잡이가 되어줍니다.',
  '논쟁이 오고가는 토론 자리에서 논리적인 모습으로 상대를 지적하기도 합니다.',
  '선두에 나서는 강인한 모습으로 많은 이들을 이끌 수 있고, 존경받는 리더가 될 수 있습니다.',
  '늘 행복과 즐거움을 추구하며, 남들을 위해 언제든 움직일 준비가 되어 있습니다.',
  '가끔 단순해보이는 모습을 보이기도 하지만, 그 내면은 깊고 실로 거대하여 우습게 볼 수 없습니다.',
  '자신만의 신념으로 자유롭게 살아가기에 그 누구도 막을 수 없을 겁니다.',
  '엄격한 모습을 자주 보일 수 있고, 이는 누구에게나 가차없을 수도 있습니다.',
];

export {
  wp_label_name,
  wp_main_txt_list,
  wp_label_appear,
  wp_label_effect,
  wp_label_color,
  wp_sub_txt_list_a,
  wp_sub_txt_list_b,
  wp_sub_txt_list_c,
  wp_spec_1_title,
  wp_spec_2_title,
  wp_spec_3_title,
  wp_spec_1_desc,
  wp_spec_2_desc,
  wp_spec_3_desc,
};
